In [1]:
import panda as pd
import numpy as np

ModuleNotFoundError: No module named 'panda'

In [2]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
s= pd.Series([45,22,17,3,33,16,8,5 ],dtype=np.int8)

In [6]:
s[4]

33

In [7]:
s

0    45
1    22
2    17
3     3
4    33
5    16
6     8
7     5
dtype: int8

In [8]:
roll=pd.Series([1,2,3,4,5])

In [9]:
name=pd.Series(['nitin','sumit','rani','anjali','smita'])

In [10]:
marks=pd.Series([60,50,5,45,78,86,5])

In [12]:
df = pd.DataFrame({
    'Roll':roll,
    'Name':name,
    'Marks':marks
})

In [13]:
df

   Roll    Name  Marks
0   1.0   nitin     60
1   2.0   sumit     50
2   3.0    rani      5
3   4.0  anjali     45
4   5.0   smita     78
5   NaN     NaN     86
6   NaN     NaN      5

In [14]:
df.dtypes

Roll     float64
Name      object
Marks      int64
dtype: object

In [15]:
df.shape

(7, 3)

In [16]:
df.size

21

In [ ]:
# https://mitu.co.in/dataset
# Download all the files whose name starts with student
# Store in current working directory in folder datasets/

In [17]:
import os

In [19]:
os.getcwd()

'C:\\Users\\rajesh'

In [20]:
df=pd.read_csv('Datasets/student.csv')

In [21]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df=pd.read_csv('Datasets/student1.csv')

In [24]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [30]:
df=pd.read_csv('Datasets/student1.csv',names=['A','B','C','D','E'])

In [31]:
df

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [32]:
df=pd.read_csv('Datasets/student1.csv',names=['A','B','C','D','E','F'])

In [33]:
df

    A        B   C      D   E   F
0   1     anil  TE  56.77  22 NaN
1   2     amit  TE  59.77  21 NaN
2   3   aniket  BE  76.88  19 NaN
3   4  ajinkya  TE  69.66  20 NaN
4   5     asha  TE  63.28  20 NaN
5   6   ayesha  BE  49.55  20 NaN
6   7     amar  BE  65.34  19 NaN
7   8    amita  BE  68.33  23 NaN
8   9     amol  TE  56.75  20 NaN
9  10    anmol  BE  78.66  21 NaN

In [35]:
None

In [37]:
df=pd.read_csv('Datasets/student1.csv',names=None)

In [38]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [39]:
df=pd.read_csv('Datasets/student.csv',names=None)

In [40]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [41]:
df=pd.read_csv('Datasets/student1.csv',header=None)

In [42]:
df

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [45]:
df3=pd.read_csv('Datasets/student3.tsv')

In [46]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [47]:
df3=pd.read_csv('Datasets/student3.tsv', sep='\t')

In [48]:
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [49]:
df3=pd.read_csv('https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv')

In [50]:
df3

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [51]:
df.dtypes

0      int64
1     object
2     object
3    float64
4      int64
dtype: object

In [52]:
df.columns

Index([0, 1, 2, 3, 4], dtype='int64')

In [53]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [54]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [55]:
df.transpose

<bound method DataFrame.transpose of     0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21>

In [56]:
df.T

       0      1       2        3      4       5      6      7      8      9
0      1      2       3        4      5       6      7      8      9     10
1   anil   amit  aniket  ajinkya   asha  ayesha   amar  amita   amol  anmol
2     TE     TE      BE       TE     TE      BE     BE     BE     TE     BE
3  56.77  59.77   76.88    69.66  63.28   49.55  65.34  68.33  56.75  78.66
4     22     21      19       20     20      20     19     23     20     21

In [57]:
df.head()

   0        1   2      3   4
0  1     anil  TE  56.77  22
1  2     amit  TE  59.77  21
2  3   aniket  BE  76.88  19
3  4  ajinkya  TE  69.66  20
4  5     asha  TE  63.28  20

In [58]:
df.head(3)

   0       1   2      3   4
0  1    anil  TE  56.77  22
1  2    amit  TE  59.77  21
2  3  aniket  BE  76.88  19

In [59]:
df.tail()

    0       1   2      3   4
5   6  ayesha  BE  49.55  20
6   7    amar  BE  65.34  19
7   8   amita  BE  68.33  23
8   9    amol  TE  56.75  20
9  10   anmol  BE  78.66  21

In [60]:
df.tail(3)

    0      1   2      3   4
7   8  amita  BE  68.33  23
8   9   amol  TE  56.75  20
9  10  anmol  BE  78.66  21

# Index Based Slicing

In [61]:
df.iloc[2:8,1:4]

         1   2      3
2   aniket  BE  76.88
3  ajinkya  TE  69.66
4     asha  TE  63.28
5   ayesha  BE  49.55
6     amar  BE  65.34
7    amita  BE  68.33

In [62]:
df.iloc[:8,:4]

   0        1   2      3
0  1     anil  TE  56.77
1  2     amit  TE  59.77
2  3   aniket  BE  76.88
3  4  ajinkya  TE  69.66
4  5     asha  TE  63.28
5  6   ayesha  BE  49.55
6  7     amar  BE  65.34
7  8    amita  BE  68.33

In [63]:
df.iloc[2:,1:]

         1   2      3   4
2   aniket  BE  76.88  19
3  ajinkya  TE  69.66  20
4     asha  TE  63.28  20
5   ayesha  BE  49.55  20
6     amar  BE  65.34  19
7    amita  BE  68.33  23
8     amol  TE  56.75  20
9    anmol  BE  78.66  21

In [64]:
df.iloc[:,:]

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [65]:
df.iloc[4:5,:]

   0     1   2      3   4
4  5  asha  TE  63.28  20

In [68]:
df.iloc[[3,7,5,9],:]

    0        1   2      3   4
3   4  ajinkya  TE  69.66  20
7   8    amita  BE  68.33  23
5   6   ayesha  BE  49.55  20
9  10    anmol  BE  78.66  21

In [69]:
df.iloc[[2,4],[2,3]]

    2      3
2  BE  76.88
4  TE  63.28

In [70]:
df.iloc[4:5,:]

   0     1   2      3   4
4  5  asha  TE  63.28  20

In [71]:
df.iloc[:,4:5]

    4
0  22
1  21
2  19
3  20
4  20
5  20
6  19
7  23
8  20
9  21

In [72]:
df.iloc[4:5,4:5]

    4
4  20

In [73]:
df.iloc[4,4]

20

# Label Based Slicing

In [76]:
df.loc[:'name']

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [77]:
df

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [78]:
df3.loc[:'name']

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [84]:
df=pd.read_csv('Datasets/student.csv')

In [85]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [86]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [88]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [89]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [90]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [91]:
df.name,marks

(0       anil
 1       amit
 2     aniket
 3    ajinkya
 4       asha
 5     ayesha
 6       amar
 7      amita
 8       amol
 9      anmol
 Name: name, dtype: object,
 0    60
 1    50
 2     5
 3    45
 4    78
 5    86
 6     5
 dtype: int64)

In [92]:
df.name.values

array(['anil', 'amit', 'aniket', 'ajinkya', 'asha', 'ayesha', 'amar',
       'amita', 'amol', 'anmol'], dtype=object)

In [93]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [97]:
df.drop([2,5,7])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [98]:
df.drop('class',axis=1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [100]:
df.drop(['class','age'],axis=1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [101]:
df.drop(['class','age'],axis=1, inplace=True)

In [102]:
df.shape

(10, 3)

# Function

In [103]:
df['marks'].max()

78.66

In [104]:
df['marks'].min()

49.55

In [105]:
df['marks'].mean()

64.499

In [106]:
df['marks'].median()

64.31

In [107]:
df['marks'].std()

9.207178901994535

In [108]:
df=pd.read_csv('Datasets/student.csv')

In [109]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [111]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [112]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [113]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [114]:
df.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [116]:
df.sum(axis=1, numeric_only=True)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [117]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [118]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [119]:
df.sort_values('class')

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [120]:
df.sort_values('class',ascending=False)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [122]:
df.sort_values(['class','marks'])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20

# custom column Operation

In [124]:
df['marks']+0.5

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [128]:
df['marks']=df['marks']+0.5

In [129]:
df

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
5     6   ayesha    BE  50.05   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   23
8     9     amol    TE  57.25   20
9    10    anmol    BE  79.16   21

In [131]:
df['cgpa']=df['marks']/10+0.034

In [132]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.27   22  5.761
1     2     amit    TE  60.27   21  6.061
2     3   aniket    BE  77.38   19  7.772
3     4  ajinkya    TE  70.16   20  7.050
4     5     asha    TE  63.78   20  6.412
5     6   ayesha    BE  50.05   20  5.039
6     7     amar    BE  65.84   19  6.618
7     8    amita    BE  68.83   23  6.917
8     9     amol    TE  57.25   20  5.759
9    10    anmol    BE  79.16   21  7.950

In [133]:
df['First_class']=df['marks']>60

In [134]:
df

   roll     name class  marks  age   cgpa  First_class
0     1     anil    TE  57.27   22  5.761        False
1     2     amit    TE  60.27   21  6.061         True
2     3   aniket    BE  77.38   19  7.772         True
3     4  ajinkya    TE  70.16   20  7.050         True
4     5     asha    TE  63.78   20  6.412         True
5     6   ayesha    BE  50.05   20  5.039        False
6     7     amar    BE  65.84   19  6.618         True
7     8    amita    BE  68.83   23  6.917         True
8     9     amol    TE  57.25   20  5.759        False
9    10    anmol    BE  79.16   21  7.950         True

In [135]:
x=['M','M','F','M','F','M','M','M','M','F']

In [136]:
df['gender']=x

In [137]:
df

   roll     name class  marks  age   cgpa  First_class gender
0     1     anil    TE  57.27   22  5.761        False      M
1     2     amit    TE  60.27   21  6.061         True      M
2     3   aniket    BE  77.38   19  7.772         True      F
3     4  ajinkya    TE  70.16   20  7.050         True      M
4     5     asha    TE  63.78   20  6.412         True      F
5     6   ayesha    BE  50.05   20  5.039        False      M
6     7     amar    BE  65.84   19  6.618         True      M
7     8    amita    BE  68.83   23  6.917         True      M
8     9     amol    TE  57.25   20  5.759        False      M
9    10    anmol    BE  79.16   21  7.950         True      F

In [148]:
ndf=pd.DataFrame({
     'roll':range(1,11),
    'cgpa':df['marks']/10+0.34,
    'gender':['M','M','F','M','F','M','M','M','M','F']
})

In [149]:
ndf

   roll   cgpa gender
0     1  6.017      M
1     2  6.317      M
2     3  8.028      F
3     4  7.306      M
4     5  6.668      F
5     6  5.295      M
6     7  6.874      M
7     8  7.173      M
8     9  6.015      M
9    10  8.206      F

In [143]:
df=pd.read_csv('Datasets/student.csv')

In [144]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [145]:
ndf.columns

Index(['Roll', 'cgpa', 'gender'], dtype='object')

In [150]:
df.merge(ndf, on='roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  6.017      M
1     2     amit    TE  59.77   21  6.317      M
2     3   aniket    BE  76.88   19  8.028      F
3     4  ajinkya    TE  69.66   20  7.306      M
4     5     asha    TE  63.28   20  6.668      F
5     6   ayesha    BE  49.55   20  5.295      M
6     7     amar    BE  65.34   19  6.874      M
7     8    amita    BE  68.33   23  7.173      M
8     9     amol    TE  56.75   20  6.015      M
9    10    anmol    BE  78.66   21  8.206      F

In [151]:
df5=pd.read_csv('Datasets/student5.csv')

In [152]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [153]:
pd.concat([df,df5])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [154]:
pd.concat([df,df5], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

In [155]:
name='Tushar'

name.lower()

In [156]:
name.lower()

'tushar'

In [157]:
df['name'].str.endswith('t')

0    False
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: name, dtype: bool

In [158]:
gr=df.groupby('class')

In [160]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [161]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [162]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [163]:
gr['marks'].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

In [164]:
df['marks']>60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [167]:
mask=df['marks']>60
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [168]:
df[df['marks']>60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [169]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [173]:
x=df[(df['marks']>60)& (df['class']=='BE')]

# Export the Data

In [174]:
x.to_csv('Datasets/output.csv',index=False)

In [175]:
x.to_html('Datasets/output.html',index=False)

# 24 Data Validation

In [176]:
import pandas as pd

In [177]:
data=pd.read_csv('Datasets/student3.tsv')

In [178]:
data

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [179]:
data=pd.read_csv('Datasets/student3.tsv', sep='\t')

In [180]:
data

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [181]:
data['age'].mean()

20.5

In [182]:
data['marks'].mean()

64.499

In [183]:
data=pd.read_csv('Datasets/student3.csv')

In [184]:
data

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28   NaN
5      6   ayesha    BE     NaN  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
9      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66   NaN
11    11   surbhi    TE     NaN  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin   NaN   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [186]:
data['marks '].mean()

66.96714285714286

In [187]:
data.columns.str.strip()

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [189]:
data['marks '].mean()

66.96714285714286

#str.strip() # for remove extra step

In [190]:
df.columns=data.columns.str.strip()

In [191]:
df['marks'].mean()

64.499